Names = [
"Абдурахманова Динара Абдурашидовна",
"Арысланова Айдана Қайратқызы",
"Асамбаева Жазерке Калибековна",
"Әжімұхан Айда Қабыланбайқызы",
"Әлім Аяулым Нурланқызы",
"Еркінбай Нұрия Мұратқызы",
"Ерубайқызы Балнұр",
"Жанаева Назгуль Сериковна",
"Жузаева Мөлдір Жұмажанқызы",
"Жұмашева Балауса Бейсенқызы",
"Ислам Балнұр Тұрдықұлқызы",
"Картанова Гулжан Заидулдаевна",
"Кахраманова Мардона Жасур кизи",
"Кумишбекова Дилбар Мадиярқизи",
"Қадыр Фариза Оңалбекқызы",
"Қамысбай Ұлжалғас Талғатқызы ",
"Қасымбек Аружан Ерманқызы",
"Қуаныш Жазира Қуанышқызы",
"Махкамбаева Индира Аскербекқызы",
"Мұханалиева Ақерке Мақсұтқызы",
"Мырзахан Алмаш Едилханқызы",
"Олжабай Сандуғаш Қайырбекқызы",
"Ошакбаева Бекзат Советкановна",
"Өмірзақ Жұлдыз Сапарғалиқызы",
"Рамаданова Гулбону Мирзамуроткизи",
"Сапарбоева Мулдир Кучкор кизи",
"Сарметенова Регина Даулеткалиевна",
"Сіргебай Жулдызай Жұмағалиқызы",
"Текебай Гулзина Байрамқызы",
"Тешебай Сымбат Әскербекқызы",
"Тұрғын Ақмарал Құдиярқызы",
"Тынысбек Әсемай Бауыржанқызы",
"Хайридин Нұрзада Мухамадиқызы",
"Шаймарданова Бағдагул Абдухашимқизи",
]

Dictionary = {}
for i in range(len(Names) - 1):
    Dictionary[Names[i]] = Names[i + 1]

print(Dictionary)